[
  {
    "id": "tb",
    "name": "Potíže přicházejí",
    "author": "The Pandemonium Institute",
    "description": "Mračna přicházejí nad Bludný Krkavčín a pohlcují toto spící městečko a jeho pověrčivé obyvatele v zlověstném stínu. Čerstvě vyprané oblečení se podivně pohupuje na šňůrách zavěšených mezi domy. Komíny vypouštějí oblaka kouře do vzduchu. Zvláštní vůně vanou skrze praskliny v oknech a pod dveřmi, když skryté kotlíky tiše bublají. Nezvykle teplý podzimní vánek proudí kolem révou porostlých stěn a zlověstně šeptá těm, kteří jsou dostatečně odvážní na to, aby chodili po vydlážděných ulicích. \n\nZnepokojené matky volají svoje děti od hrátek zpátky domů, neboť se na horizontu začíná schylovat k bouři. Pokud ale budeš poslouchat pozorněji, tak můžeš slyšet ještě divnější zvuky ozývající se z nedalekého lesa. Bdělým okem z tyčícího se kláštera lze spatřit obrysy postav chodících od domu k domu. Ti, kteří porozuměli těmto znamením tuší, že... Potíže přicházejí.",
    "level": "Začátečník",
    "roles": [],
    "isOfficial": true
  },
  {
    "id": "bmr",
    "name": "Čas krvavého měsíce",
    "author": "The Pandemonium Institute",
    "description": "Slunce je pohlceno členitým horizontem, když další zimní den mizí v noci. Oranžové a červené skvrny postupně tmavnou do hnědých tónů, les se mění v tichém očekávání přicházejícího sněhu. \n\nHladoví vlci vyjí z útrob skalní trhliny za hranicemi města, rozprchávajíce ptáky z jejich útulných hnízd. Poutníci spěchají do hostince, hledaje úkryt před přicházející zimou. Zahřívají se horkým čajem, příjemnými tóny hudby a chutným pivem, netušíce divných a zlověstných očí, které je sledují z ruin tohoto kdysi honosného města. \n\nDnes v noci dokonce i dobytek tuší, že je... Čas krvavého měsíce.",
    "level": "Pokročilý",
    "roles": [],
    "isOfficial": true
  },
  {
    "id": "snv",
    "name": "Sekty a fialky",
    "author": "The Pandemonium Institute",
    "description": "Pestrobarevné jaro ustupuje teplému a vlídnému létu. Kytičky všech druhů kvetou všude, kam jen oko dohlédne, něžně opečovávané ve veřejných zahradách a okenních truhlících, shlížejících na honosnou promenádu. Ptáčci zpívají, umělci malují a filozofové hloubají o největších záhadách života uvnitř rušné hospody, zatímco cirkus staví svůj mile roztrhaný stan na kraji města. \n\nZatímco se měšťané baví lehkomyslnostmi a rošťárnami, oddávajíc se dobré zábavě a leště lepšímu vínu, temné a tajné síly se tiše shromažďují. Čarodějnice a kulty se ukrývají v majestátních ruinách na okraji města, pořádají tajná setkání v podzemních jeskyních a zlověstně kují pád Bludného Krkavčína a jeho rozjařených obyvatel. \n\nČas dozrál pro... Sekty a fialky.",
    "level": "Pokročilý",
    "roles": [],
    "isOfficial": true
  },
  {
    "id": "luf",
    "name": "Laissez un Faire",
    "author": "The Pandemonium Institute",
    "description": "",
    "level": "Zkušený",
    "roles": ["balloonist", "savant", "amnesiac", "fisherman", "artist", "cannibal", "mutant", "lunatic", "widow", "goblin", "leviathan"],
    "isOfficial": true
  }
]
